os/dining_philosophers_problem.html
---
layout: page
title: Dining_philosophers_problem
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Philosphenproblem</h2>
<div class="outline-text-2" id="text-1">
<p>
Setting:
</p>

<ul class="org-ul">
<li>\(n\) Philosphen sitzen um einen runden Tisch
</li>
<li>zu jedem Zeitpunkt kann ein Philosoph entweder denken oder essen
</li>
<li>zum Essen braucht jeder Pholosoph zwei Gabeln/Stäbchen
</li>
<li>zwischen zwei nebeneinandersitzenden Philosphen liegt jeweils eine
Gabel/Stäbchen (also liegen insg. \(n-1\) Gabeln/Stäbchen auf dem
Tisch)
</li>
</ul>

<p>
Strategien zur Vermeidung von <i>Deadlocks</i>:
</p>

<ul class="org-ul">
<li>min. ein Philosoph nimmt seine Stäbchen in umgekehrter Reihenfolge
auf
</li>
<li>Vermeidung von <i>Hold and Wait</i>: Philosophen nehmen erst ein Stäbchen
auf und prüfen dann, ob ihr zeites Stäbchen auch frei ist. Wenn nicht
legen sie das erste Stäbchen wieder hien
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Implementierungen</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Die Sticks <code>left</code> und <code>right</code> sind in den folgenden Codebeispielen
Semaphore.
</p>

<p>
<b>Implementierung mit Deadlocks:</b>
</p>

<pre class="example">
philosopher() {
  while(true) {
    think();

    p(left);
    p(right);
    eat();
    v(left);
    v(right);
</pre>

<p>
<b>Implementierung ohne Deadlocks:</b>
</p>

<pre class="example">
philosopher() {
  while(true) {
    think();

    p(left);
    if(right == 0) {
      v(left);
    } else {
      p(right);
      eat();
      v(left);
      v(right);
    }
</pre>

<p>
Schlimmstenfalls passiert folgendes: Jeder bis auf der letzte Philosoph
nimmt sein linkes Stäbchen auf, stellt dann fest, dass sein rechtes frei
ist und wird dann suspendiert. Der letzte Philosoph nimmt sein linkes
Stäbchen auf und muss dann feststellen, dass sein rechtes Stäbchen nicht
frei ist und legt dieses daraufhin wieder ab (dabei kann er zwar
unterbrochen werden, aber bei fairem Scheduling kommt es zu keinem
Livelock).
</p>
</div>
</div>
</div>
